---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EndTreatment
source: html/72ad30b1-8e8d-49f2-6e03-a8132f6f53e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EndTreatment Property

"End Treatment"

## Syntax (C#)
```csharp
public static ForgeTypeId EndTreatment { get; }
```